#include "common.h"

/*****************************************
 *∫¡√Î—” ±∫Ø ˝
 *¿˝:delay_ms(1000);    —” ±1000∫¡√Î 
 *****************************************/
void delay(unsigned int ms)
{
	xdata unsigned int i = 50;

	while(ms --)
	{
		while(i --);
		i = 50;
	}

}

/*****************************************
 *—” ±10ms∫Ø ˝
 *¿˝:delay_10ms();    —” ±10∫¡√Î 
 *****************************************/
void delay_10ms(void)
{

}

/*****************************************
 *Œ¢√Î—” ±∫Ø ˝
 *¿˝:delay_us(1000);    —” ±1000Œ¢√Î 
 *****************************************/
void delay_us(unsigned int us)
{
	while(us --)
	{
		_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
		_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
		_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
		
	}
}